ideologies = {
    "Ультрамилитаризм":"Радикальная идеология, которая подразумевает перманентную войну со всем окружающим миром. Любые союзы невозможны, дипломатия отвратительна, но промышленность и армия идеальны, а налоги невероятно высоки.",
    "Стратократия": "Более человечная версия ультрамилитаризма, где государство служит армии, но без фанатизма. Фактически, при этой идеологии правит верховное командование. Налоги высокие, но в рамках разумного, промышленность работает на армию, армия может быть как сильной, так и погрязшей в коррупции (зависит от страны), дипломатические отношения поддерживают со всеми, кто готов с ними сотрудничать, но испытывают явные трудности в построении своей дипломатии, так как генералам привычнее воевать.",
    "Национализм":"Идеология, подразумевающая превосходство нации, страны с этой идеологией стремятся к возрождению своей родины из пепла. В деталях же страны данной идеологии сильно отличаются: одни могут быть более милитаристическими и желать мобилизовать всё население в крестовый поход за нацию, а другие, наоборот, питают слабость к левым взглядам и хотят построить лучшую страну для своей нации, так что конкретные показатели могут сильно отличаться от страны к стране, но конечная цель одна - возрождение нации, отличия разве что в цене и радикальности.",
    "Фашизм":"Идеология третьего пути, не всегда тираническая, но, как и национализм, стоит на страже своего порядка. Страны с этой идеологией, как и националисты, могут быть как радикалами-милитаристами, так и своего рода авторитарными социалистами, но, в отличие от националистических, страны с этой идеологией нередко тонут в коррупции, что снижает все их показатели. Впрочем, фашизм без коррупции отличается в равной степени хорошей дипломатией, промышленность, армией, а также высокой стабильностью и милитаризацией. Некоторые фашистские страны могут стремиться к государству всеобщего благоденствия.",
    "Автократия":"Классическая монархия. В меру консервативная и в меру сильная идеология, не разделяет левых ценностей, отличается высокими налогами, чаще делает акцент на сильной армии. В редких случаях утопает в коррупции.",
    "Диктатура":"Идеология, присущая государствам без принципов. Они не заинтересованы в улучшении жизни своего народа, не желают объединять нацию, их главная цель - увеличение собственной прибыли любой ценой. Имеют ужасную репутацию во всём остальном мире.",
    "Технократия":"Самая мирная идеология. Все, кроме ультрамилитаристов, терпимы к технократии, многие даже хотят видеть их в качестве своих союзников. Фактически, это более дипломатические и более технологически развитые социалисты, которые видят построение государства всеобщего благоденствия только через неустанное технологическое развитие. Могут быть пацифистами, но некоторые технократии более радикальные и желают освободить народы от диких варваров, принеся им просвещение.",
    "Консерватизм": "Фактическая демократия. Идеология тех, кто просто хочет вернуть былой режим, это остатки бывших легитимных правительств и просто государства, где народ хочет жить без страха умереть от бандитской пули. Отличаются немного завышенными налогами (стремятся их снизить), хорошей промышленностью, хорошей дипломатией и в организованной армией. Тем не менее, иногда такие государства страдают от коррупции.",
    "Либерализм": "Идеология, довольно близкая по духу к диктатуре, но скрывающаяся под демократическим фасадом. Как и диктатуры, либеральные государства не жалеют свой народ и стремятся в первую очередь к обогащению собственной казны. Несмотря на отвратительное состояние промышленности (эффективность зданий в лучшем случае 0.5), имеют довольно сильную армию, которая, впрочем, стоит непомерно много.",
    "Социализм": "Довольно мирная идеология, которая видит государство защитником народа. Государства с этой идеологией стремятся к отсутствию налогов (поначалу у них просто сниженная налоговая ставка), вместо этого полагаясь на наращивание промышленной мощи. Имеют хорошую репутацию, развитую дипломатию. Состояние армии зависит от конкретного государства, но все страны с этой идеологией предпочитают не участвовать в наступательных войнах.",
    "Коммунизм": "Более радикальная версия социализма. Данная идеология имеет ужасные дипломатические показатели, но при этом армия и естественный рост населения у коммунистов на высоте (0.015 рост населения - вполне нормальный показатель для коммунистов). Как и социализм, выступает за построение государства всеобщего благоденствия, но коммунисты готовы воевать за построение такого общества. Налоги стремятся сделать как можно ниже, полагаясь на эффективность работы зданий.",
    "Анархизм": "Одна из самых неоднозначных идеологий. Анархо-капиталисты вымерли вскоре после краха былой цивилизации, а вот левые анархисты и даже анархо-примитивисты выжили. Общей особенностью всех анархистов является непомерно высокий боевой дух при сниженной атаке, а также их отличает ужасная дипломатия и 100%-ые налоги при нулевой эффективности зданий (это не означает, что население платит все свои деньги, ведь государства нет, 100%-ые налоги подразумевают, что население анархических стран полностью обеспечивает всю страну своим трудом). Но отдельные анархисты имеют свои бонусы и штрафы. Например, анархо-примитивисты имеют репутацию -100, штрафы от -0.5 до -0.75 ко всем армейским параметрам, но прирост населения у них может достигать 0.1, то есть ежемесячно население их городов увеличивается на 10%.",
    "Теократия": "Полная противоположность технократии. Теократия выступает за предельно традиционные ценности и отрицает любое развитие, но религиозный пыл увеличивает стойкость их армий, а репутация наследников былой цивилизации способствует хорошей дипломатии, равно как традиционные ценности повышают рост населения и гарантируют высокую стабильность. Тем не менее, у них высокие налоги и низкая эффективность зданий.",
    "Правое народничество": "Народничество - идеология, отрицающая идеологии как таковые. Это движение, выступающее за возрождение национального государства и обеспечение благополучия для всего населения. Все народники выступают за низкие налоги и развитие промышленности. Также все народники против коррупционных режимов, они не станут вести переговоры со странами, где процветает клептократия и угнетается собственный народ. Конкретно правое народничество отличается более радикальными и милитаристическими методами, у них более сильная армия, более высокие налоги (снизить их они всё равно хотят, но не так сильно, как другие народники), более эффективные здания и плохая дипломатия. Также правые народники идеологически близки к националистам, но они всё же отрицают этнический национализм, выступая за более левый гражданский национализм и патриотизм.",
    "Левое народничество": "Данный подвид народничества тяготеет к идеям социалистов и коммунистов, фактически являясь идеальной левой идеологией с милитаризмом коммунистов и репутацией социалистов.",
    "Авторитарное народничество": "Самое ортодоксальное народничество. Они не видят различий в идеологиях, их главная цель - свобода и счастье народа. Цена и методы не важны, поэтому в период кризиса, как и правые народники, авторитарные народники могут сильно завышать налоги."
}

ideology_relations = {
    "Ультрамилитаризм":{
        "Враждебны":["Ультрамилитаризм", "Стратократия", "Национализм", "Фашизм", "Автократия", "Диктатура",
                     "Технократия", "Консерватизм", "Либерализм", "Социализм","Коммунизм","Анархизм", "Теократия",
                     "Правое народничество", "Левое народничество", "Авторитарное народничество"],
        "Нейтральны":[],
        "Дружественны":[]
    },
    "Стратократия":{
        "Враждебны":["Ультрамилитаризм", "Либерализм", "Социализм", "Коммунизм", "Анархизм", "Левое народничество"],
        "Нейтральны":["Стратократия", "Национализм", "Фашизм", "Консерватизм", "Теократия", "Правое народничество", "Авторитарное народничество"],
        "Дружественны":["Автократия", "Диктатура", "Технократия"]
    },
    "Национализм":{
        "Враждебны":["Ультрамилитаризм", "Либерализм", "Коммунизм", "Анархизм"],
        "Нейтральны":["Стратократия", "Фашизм", "Автократия", "Диктатура", "Технократия", "Консерватизм", "Социализм", "Теократия", "Левое народничество"],
        "Дружественны":["Национализм", "Правое народничество", "Авторитарное народничество"]
    },
    "Фашизм":{
        "Враждебны":["Ультрамилитаризм", "Коммунизм", "Анархизм"],
        "Нейтральны":["Национализм", "Консерватизм", "Либерализм", "Социализм", "Правое народничество", "Левое народничество"],
        "Дружественны":["Стратократия", "Фашизм", "Автократия", "Диктатура", "Технократия", "Теократия", "Авторитарное народничество"]
    },
    "Автократия":{
        "Враждебны":["Ультрамилитаризм", "Коммунизм", "Анархизм"],
        "Нейтральны":["Национализм", "Технократия", "Либерализм", "Социализм", "Правое народничество", "Левое народничество"],
        "Дружественны":["Стратократия", "Фашизм", "Автократия", "Диктатура", "Консерватизм", "Теократия", "Авторитарное народничество"]
    },
    "Диктатура":{
        "Враждебны":["Ультрамилитаризм", "Социализм", "Коммунизм", "Анархизм", "Левое народничество"],
        "Нейтральны":["Национализм", "Технократия", "Либерализм", "Теократия", "Правое народничество", "Авторитарное народничество"],
        "Дружественны":["Стратократия", "Фашизм", "Автократия", "Диктатура", "Консерватизм"]
    },
    "Технократия":{
        "Враждебны":["Ультрамилитаризм", "Стратократия", "Теократия"],
        "Нейтральны":["Национализм", "Фашизм", "Автократия", "Диктатура", "Консерватизм", "Либерализм", "Анархизм", "Авторитарное народничество"],
        "Дружественны":["Технократия", "Социализм", "Коммунизм", "Левое народничество", "Правое народничество"]
    },
    "Консерватизм":{
        "Враждебны":["Ультрамилитаризм", "Коммунизм", "Анархизм", "Диктатура"],
        "Нейтральны":["Стратократия", "Национализм", "Фашизм", "Либерализм", "Теократия", "Правое народничество", "Левое народничество"],
        "Дружественны":["Автократия", "Технократия", "Консерватизм", "Социализм", "Авторитарное народничество"]
    },
    "Либерализм":{
        "Враждебны":["Ультрамилитаризм", "Национализм", "Коммунизм", "Анархизм", "Правое народничество","Левое народничество", "Авторитарное народничество"],
        "Нейтральны":["Стратократия", "Фашизм", "Автократия", "Консерватизм", "Теократия", "Социализм"],
        "Дружественны":["Технократия", "Диктатура", "Либерализм"]
    },
    "Социализм":{
        "Враждебны":["Ультрамилитаризм", "Стратократия", "Диктатура"],
        "Нейтральны":["Национализм", "Фашизм", "Автократия", "Теократия", "Либерализм"],
        "Дружественны":["Технократия", "Консерватизм", "Социализм", "Коммунизм", "Анархизм", "Правое народничество", "Левое народничество", "Авторитарное народничество"]
    },
    "Коммунизм":{
        "Враждебны":["Ультрамилитаризм", "Стратократия", "Национализм", "Фашизм", "Автократия", "Диктатура", "Либерализм", "Теократия"],
        "Нейтральны":["Консерватизм", "Правое народничество", "Авторитарное народничество"],
        "Дружественны":["Технократия", "Социализм", "Коммунизм", "Анархизм", "Левое народничество"]
    },
    "Анархизм":{
        "Враждебны":["Ультрамилитаризм", "Стратократия", "Национализм", "Фашизм", "Автократия", "Диктатура", "Консерватизм", "Либерализм", "Теократия", "Правое народничество", "Авторитарное народничество"],
        "Нейтральны":["Технократия", "Левое народничество"],
        "Дружественны":["Социализм", "Коммунизм", "Анархизм"]
    },
    "Теократия":{
        "Враждебны":["Ультрамилитаризм", "Диктатура", "Технократия", "Социализм", "Коммунизм", "Анархизм", "Левое народничество"],
        "Нейтральны":["Стратократия", "Национализм", "Авторитарное народничество"],
        "Дружественны":["Консерватизм", "Фашизм", "Автократия", "Теократия", "Правое народничество"]
    },
    "Правое народничество":{
        "Враждебны":["Ультрамилитаризм", "Либерализм", "Анархизм", "Диктатура"],
        "Нейтральны":["Стратократия", "Фашизм", "Автократия", "Коммунизм", "Левое народничество"],
        "Дружественны":["Национализм", "Консерватизм", "Социализм", "Теократия", "Технократия", "Правое народничество", "Авторитарное народничество"]
    },
    "Левое народничество":{
        "Враждебны":["Ультрамилитаризм", "Стратократия", "Диктатура", "Либерализм"],
        "Нейтральны":["Национализм", "Фашизм", "Автократия", "Консерватизм", "Анархизм", "Теократия", "Правое народничество"],
        "Дружественны":["Технократия", "Социализм", "Коммунизм", "Левое народничество", "Авторитарное народничество"]
    },
    "Авторитарное народничество":{
        "Враждебны":["Ультрамилитаризм", "Либерализм", "Анархизм", "Диктатура"],
        "Нейтральны":["Стратократия", "Коммунизм", "Теократия"],
        "Дружественны":["Национализм", "Фашизм", "Автократия", "Технократия", "Консерватизм", "Социализм", "Правое народничество", "Левое народничество", "Авторитарное народничество"]
    },
}